const ids = [
 'indexId','takeawayId','activityId','recruitmentId','contactUsId'
 ,'linkId','indexsId','activitysId',
];
var zh = [
 '首页','外卖','活动','招聘','联系我们','您的位置:','首页','活动',
'4月1日敢信吗？','我的名字叫小尾羊','不要告诉别人，你的肚子是被我们搞大的','小尾羊火锅周年庆，吃多少送多少！','小尾羊滋补美味外卖闪亮登场',
'病毒肆虐，吃货该怎么办？吃啥？','过年，华人最喜欢吃啥',
 '饭前小尾羊猜灯谜换菜品','小尾羊追求鲜美，拒绝腥膻','饭前蒙古屋 饭后广场舞','农历七月七牛郎会织？','烧烤夜市套餐 每晚9点开档',
 
 ]; 
var en = [
 'INDEX','TAKE AWAY','EVENT','RECRUITMENT','CONTACT US','Your Location:', 'Index','Activity',
'4月1日敢信吗？','我的名字叫小尾羊','不要告诉别人，你的肚子是被我们搞大的','小尾羊火锅周年庆，吃多少送多少！','小尾羊滋补美味外卖闪亮登场',
'病毒肆虐，吃货该怎么办？吃啥？','过年，华人最喜欢吃啥',
 '饭前小尾羊猜灯谜换菜品','小尾羊追求鲜美，拒绝腥膻','饭前蒙古屋 饭后广场舞','农历七月七牛郎会织？','烧烤夜市套餐 每晚9点开档',
 ]; 
 